[
    {
        "id": 1,
        "title": "AI Virtual Try-On",
        "image": "/images/try-on.png",
        "url": "https://try-on-gamma.vercel.app/en",
        "technologies": [
            "Next.js",
            "Tailwind CSS",
            "TypeScript",
            "Supabase"
        ],
        "summary": "An AI-powered platform designed for e-commerce to transform flat-lay clothing photos into professional on-model images, eliminating the need for physical photoshoots.",
        "description": "Built with the latest web technologies including *Next.js 16*, *React 19*, and *Tailwind CSS 4*, this application revolutionizes how online sellers present their inventory. Users can upload simple ghost mannequin or flat-lay photos and instantly generate high-quality, realistic model images using *advanced generative AI*. The platform features a robust credit-based system integrated with *Stripe* for secure payments, allowing users to choose between different AI configurations ranging from basic to ultra-premium quality. \nBeyond standard try-on capabilities, the \"*Studio Generation*\" feature offers e-commerce ready front and back views with perfect lighting and shadows. The application ensures a seamless user experience with *Supabase authentication*, *cloud-native image processing*, and a responsive, localized interface available in *multiple languages*. It addresses the privacy and logistical challenges of modeling clothes, making professional product photography accessible to everyone.",
        "features": {
            "AI Virtual Try-On": "Instantly dresses AI-generated models in user-uploaded garments using Google Vertex AI (Imagen 3 & 4).",
            "Studio Quality Generation": "Produces professional front and back product shots from imperfect input images.",
            "Modern Tech Stack": "Developed with Next.js 16, React 19, TypeScript, and Tailwind CSS 4 for peak performance.",
            "Credit System & Payments": "Integrated Stripe payments with a tiered credit consumption model for different AI quality levels.",
            "Authentication & Security": "Secure user management and data protection powered by Supabase.",
            "Internationalization": "Fully localized interface supporting English and Hungarian via `next-intl`.",
            "Cloud Infrastructure": "Scalable serverless architecture utilizing Google Cloud Platform for heavy AI workloads."
        }
    },
    {
        "id": 2,
        "title": "Car Rental Management System",
        "image": "/images/car-rental.png",
        "technologies": [
            "Java Spring Boot",
            "React",
            "TypeScript",
            "MySQL"
        ],
        "summary": "A full-stack Car Rental Management System designed to streamline vehicle leasing operations.",
        "description": "This comprehensive Car Rental Management System offers a modern digital solution for vehicle rental businesses. At its core, the application features a powerful *Spring Boot* backend that handles complex business logic and data persistence via *MySQL*, ensuring data integrity and fast response times. \nThe frontend, developed with *React* and *Vite*, provides a responsive and interactive user experience enhanced by *TailwindCSS* and *Material UI*. The system is designed with scalability in mind, utilizing RESTful APIs to facilitate secure and efficient communication between client and server.",
        "features": {
            "Fleet Management": "Complete CRUD operations for managing vehicle inventory, including specifications and availability status.",
            "User Administration": "Secure user authentication and profile management for both administrators and customers.",
            "Loan Processing": "Streamlined workflow for processing vehicle loans, tracking rentals, and managing returns.",
            "Modern UI/UX": "Responsive interface built with React, styled with TailwindCSS and MUI, and enhanced with GSAP animations.",
            "Data Persistence": "Robust MySQL database integration using Hibernate ORM for reliable data storage and retrieval.",
            "RESTful Architecture": "Scalable API design ensuring efficient data exchange between the client and server."
        }
    }
]